:PROPERTIES:
:ID:       20230808T035500.251803
:END:
#+title: CLTS: common lisp-the series
#+filetags: :yt:lisp:

**** Instance: byte code

#+begin_src python :results output
  import dis

  def add10(x:int) -> int:
    return x + 10

  print(dis.dis(add10))
#+end_src

#+RESULTS:
:   4           0 LOAD_FAST                0 (x)
:               2 LOAD_CONST               1 (10)
:               4 BINARY_ADD
:               6 RETURN_VALUE
: None


*** Why the Parentheses?

- infix to prefix

- uniformity over promoting convenient habits

#+begin_src python :results output
  print(23 + 234 + 100)
#+end_src

#+RESULTS:
: 357

#+begin_src lisp 
  (+ 23 234 100)
#+end_src

#+RESULTS:
: 357

#+begin_src python :results output
  print(sum([23,234,100]))
#+end_src

#+RESULTS:
: 357


*** Pseudo-Code

#+begin_src pseudo
:INPUT -> temperature in celcius
:OUTPUT -> temperature in fahrenheit

:BEGIN
 - multiply by 9
 - divide by 5
 - add 32
 - return as output
:END
#+end_src

#+begin_src python :results output
  def celc2fahr(celc):
    return (celc * 9) / 5 + 32

  print(celc2fahr(0))
#+end_src

#+RESULTS:
: 32.0

#+begin_src lisp
  (defun celc2fahr (celc)
    (+ (/ (* celc 9)
  	5)
       32))

  (celc2fahr 0)
#+end_src

#+RESULTS:
: 32

